content/pages/about.md
+++
title = "About"
author = ["TRNEEDANAME"]
date = 2025-10-13
publishDate = 2025-10-13
layout = "page"
draft = false
ShowToc = "false ShowBreadCrumbs: false"
ShowPostNavLinks = false
+++

## Who I am {#who-i-am}

Hi :wave: !

I'm TRNEEDANAME, a french game dev / mod maker.
This site is my blog, where you'll find what I did and what I'm doing.


### What I use {#what-i-use}

I use Linux as my main OS (NixOS to be precise), before that I used Arch for close to 4 years.

As my text editor / IDE / everything else (mostly), I use [Emacs](https://www.gnu.org/software/emacs/emacs.html) because I write in org-mode (I use a framework called [Doom Emacs](https://github.com/doomemacs/doomemacs)).

The file you're reading is in fact a `.org` file !


### What I do {#what-i-do}

I make mods for [Project Zomboid](https://projectzomboid.com/blog/) and [Xcom](https://xcom.com) in my spare time, I started with Xcom 2 in ~2020, in 2024 I joined the Project Zomboid RP scene as a player, then admin / mod maker for another server.

I also play games, as of now I'm playing Satisfactory / Project Zomboid.

I enjoy writing wikis, as show by my [Militia wiki](https://github.com/TRNEEDANAME/Militia_Wiki/wiki) for Xcom 2 (still in the work as of now)


### Technology used by this site {#technology-used-by-this-site}

This site is made using [Hugo](https://gohugo.io/) with [ox-hugo](https://ox-hugo.scripter.co/), I have [Hugo admonitions](https://github.com/KKKZOZ/hugo-admonitions) as a plugin installed, but as it doesn't work with [org-mode](https://orgmode.org/), I had to write a minor mode for it.


## Contact me {#contact-me}

To contact me please send me an email to [trneedaname@proton.me](mailto:trneedaname@proton.me) if it is related to this site, otherwise please use fill a bug report on the github repository of the mod / steam page.
